shared_fortunes = [
    "오늘 산책하며 혼자 생각하기 좋은 날입니다.",
    "매력적인 말로 상대방을 사로잡아 보세요!",
    "자연의 아름다움을 찾아보는 것이 좋은 날입니다.",
]

fortunes = {
    "INFP": shared_fortunes + ["오늘 햇살이 많이 드는 날입니다."],
    "ENFP": [
        "오늘 햇살이 많이 드는 날입니다.",
        "밝은 에너지로 주변을 활력을 불어넣어보세요!",
        "새로운 사람들과의 만남이 행운을 가져올 것입니다.",
    ],
    "INFJ": [
        "내면의 감정을 정리하며 조용한 시간을 가져보세요.",
        "타인에게 따뜻한 도움을 주는 것이 더욱 의미있는 날입니다.",
        "일상의 소소한 것에 기쁨을 느낄 수 있는 날이 될 것입니다.",

    ],
    "ENFJ": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "ISTJ": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "ESTP": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "ESFJ": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "ESFP": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "ENTJ": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "ENTP": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],     
    "ESTJ": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],   
    "ISFJ": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],     
    "ISTP":shared_fortunes,
    
    "ISFP": [
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
    ],
    "nonuser":[
        "다른 사람을 위해 시간을 내주는 것이 좋은 날입니다.",
        "사회적인 활동을 통해 새로운 인연을 만들 수 있는 기회가 있을 것입니다.",
        "감정적으로 기운이 떨어질 때에도 희망을 잃지 마세요.",
        
    ],
       
}